-- -*- M2-comint -*- {* hash: -1396000375 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R=CC[x0,x1,x2]

o1 = R

o1 : PolynomialRing

i2 : F={x0^3-x1^3+x2^3+1}

        3     3     3
o2 = {x0  - x1  + x2  + 1}

o2 : List

i3 : sliceH=makeB'Slice({2},{{x0,x1,x2,1}},NameB'Slice=>"H")
2
{{}, {}}

o3 = B'Slice{...4...}

o3 : B'Slice

i4 : bWriteInputFile(storeBM2Files,
         AffVariableGroup=>{x0,x1,x2},
         ParameterGroup=>{T},
         B'Configs=>{{ParameterHomotopy,1}},
         B'Functions=>{sliceH},
         B'Polynomials=>{"H0+T","H1"}|F)

o4 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-24466-0/0/input

o4 : File

i5 : runBertini(storeBM2Files,PreparePH2=>true)

i6 : bTraceTestImage(storeBM2Files)

o6 = {-1.11022e-16-1.11022e-16*ii, 1.77636e-15, 1.77636e-15}

o6 : List

i7 : R=CC[x,y,z]**CC[a,b]

o7 = R

o7 : PolynomialRing

i8 : xyzSub={{x,a},{y,a^2+b},{z,a^2+b^2}}

                   2            2    2
o8 = {{x, a}, {y, a  + b}, {z, a  + b }}

o8 : List

i9 : sliceH=makeB'Slice({2},{{x,y,z,1}},NameB'Slice=>"H")
2
{{}, {}}

o9 = B'Slice{...4...}

o9 : B'Slice

i10 : bWriteInputFile(storeBM2Files,
          AffVariableGroup=>{a,b},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>xyzSub|{sliceH},
          B'Polynomials=>{"H1","H0+T"})

o10 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-24466-0/0/input

o10 : File

i11 : runBertini(storeBM2Files,PreparePH2=>true)

i12 : s=importSolutionsFile(storeBM2Files)

o12 = {{-.504933+3.14448*ii, 3.91941+.48428*ii}, {-.111402+1.09331*ii,
      -----------------------------------------------------------------------
      -1.77917-.114714*ii}, {-.900291-.567416*ii, -.283048-1.15703*ii},
      -----------------------------------------------------------------------
      {-.18092-.662033*ii, .142808+.787463*ii}}

o12 : List

i13 : bTraceTestImage(storeBM2Files,MapPoints=>({a,a^2+b,a^2+b^2},{a,b}))

o13 = {8.88178e-16 - 1.33227e-15*ii, 3.55271e-15 - 1.11022e-15*ii,
      -----------------------------------------------------------------------
      1.95399e-14 + 1.33227e-15*ii}

o13 : List

i14 : R=CC[x0,x1,x2]

o14 = R

o14 : PolynomialRing

i15 : F={x0^3-x1^3+x2^3+1}

         3     3     3
o15 = {x0  - x1  + x2  + 1}

o15 : List

i16 : sliceH=makeB'Slice(2,{x0,x1,x2,1},NameB'Slice=>"H")
2
{{}, {}}

o16 = B'Slice{...4...}

o16 : B'Slice

i17 : bWriteInputFile(storeBM2Files,
          AffVariableGroup=>{x0,x1,x2},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>{sliceH},
          B'Polynomials=>{"H0+T","H1"}|F)

o17 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-24466-0/0/input

o17 : File

i18 : runBertini(storeBM2Files,PreparePH2=>true)

i19 : bTraceTestImage(storeBM2Files,StopBeforeTest=>true)--Returns the trace for each parameter homotopy using -gammma, 0, and gamma respectively.

o19 = {{-.0017626-.365213*ii, .390464+.362182*ii, -2.04763+.396267*ii},
      -----------------------------------------------------------------------
      {-.361194-.66503*ii, .428808+.257877*ii, -1.9164+.774947*ii},
      -----------------------------------------------------------------------
      {-.720625-.964847*ii, .467153+.153572*ii, -1.78516+1.15363*ii}}

o19 : List

i20 : 
